#### Terraform working directory 🏠: `demo/demo-account/demo-application/elb`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lb_instances.module.lb["alb-test"].module.lb.aws_lb_listener_rule.http_tcp_listener_rule["100"] will be created
  + resource "aws_lb_listener_rule" "http_tcp_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:129980683758:listener/app/alb-test/2093a8845af899e5/46e0550cccf9d9f6"
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:129980683758:targetgroup/prdapp/db2c577b4172b4ab"
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/forward/*",
                ]
            }
        }
    }

  # module.lb_instances.module.lb["alb-test"].module.lb.aws_lb_listener_rule.http_tcp_listener_rule["101"] will be created
  + resource "aws_lb_listener_rule" "http_tcp_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:129980683758:listener/app/alb-test/2093a8845af899e5/46e0550cccf9d9f6"
      + priority     = 101
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "www.test.com.sg"
              + path        = "/"
              + port        = "80"
              + protocol    = "HTTP"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/redirect/*",
                ]
            }
        }
    }

  # module.lb_instances.module.lb["alb-test"].module.lb_tg_attachment["tst-ath-0"].aws_lb_target_group_attachment.this will be created
  + resource "aws_lb_target_group_attachment" "this" {
      + id               = (known after apply)
      + port             = 8080
      + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:129980683758:targetgroup/prdapp/db2c577b4172b4ab"
      + target_id        = "i-04135475dc7445b8f"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
